
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       3 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                   |
|:--------:|:----------------------------------------------------------------------------|
|    🟢     | `module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]` |
|    🟢     | `module.repos["proxysql-sandbox"].github_repository.repo`                   |
|    🟢     | `module.repos["proxysql-sandbox"].github_team_repository.dev`               |
|    🟢     | `module.ih8_tf_template.github_repository.repo:`                            |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/61bfc57f-8f24-4c2a-8c68-db2e098c81ec/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
module.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
data.external.env: Reading...
data.external.env: Read complete after 0s [id=-]
module.ih_8_repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]
module.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
github_team.dev: Refreshing state... [id=7332815]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
module.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
data.aws_secretsmanager_secrets.gh_secrets: Reading...
data.aws_ssm_parameter.gh_secrets_namespace: Reading...
data.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]
module.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]
github_team_members.dev: Refreshing state... [id=7332815]
data.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]
module.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]
module.ih_8_repos["aws-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-control:akuzminsky]
module.ih_8_repos["aws-control"].github_branch_default.main: Refreshing state... [id=aws-control]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]
module.ih_8_repos["aws-s3-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-s3-control:akuzminsky]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_key: Reading...
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]
module.aws_creds["aws-control"].data.aws_secretsmanager_secret.aws_key: Reading...
module.aws_creds["aws-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]
module.aws_creds["aws-s3-control"].data.aws_secretsmanager_secret.aws_key: Reading...
module.aws_creds["aws-s3-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_s3-QMEaDX]
module.aws_creds["github-control"].data.aws_secretsmanager_secret.aws_key: Reading...
module.aws_creds["github-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_github-iYMNb3]
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_key: Reading...
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["infrahouse-aws-control"].github_repository.repo: Refreshing state... [id=infrahouse-aws-control]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_key: Reading...
module.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 1s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...
module.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]
module.aws_creds["aws-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...
module.aws_creds["aws-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]
module.aws_creds["aws-s3-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...
module.aws_creds["aws-s3-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_s3-QMEaDX|AWSCURRENT]
module.aws_creds["github-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...
module.aws_creds["github-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_github-iYMNb3|AWSCURRENT]
module.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=aws-s3-control:AWS_ACCESS_KEY_ID]
module.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=aws-control:AWS_ACCESS_KEY_ID]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=aws-s3-control:AWS_SECRET_ACCESS_KEY]
module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=github-control:AWS_DEFAULT_REGION]
module.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=aws-control:AWS_SECRET_ACCESS_KEY]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=aws-s3-control:AWS_ROLE]
module.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]
module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=github-control:AWS_SECRET_ACCESS_KEY]
module.ih_8_repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-s3-control:AWS_DEFAULT_REGION]
module.ih_8_repos["aws-s3-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-s3-control:GH_TOKEN]
module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=github-control:AWS_ACCESS_KEY_ID]
module.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=github-control:AWS_ROLE]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
module.repos["infrahouse-aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-aws-control]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
module.ih_8_repos["aws-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCxf584CEeam]
module.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=infrahouse-website-infra:AWS_SECRET_ACCESS_KEY]
module.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]
module.repos["infrahouse-aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-aws-control:AWS_DEFAULT_REGION]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=infrahouse-website-infra:AWS_ROLE]
module.repos["infrahouse-aws-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=infrahouse-aws-control:AWS_ROLE]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]
module.repos["infrahouse-aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-aws-control:GH_TOKEN]
module.repos["infrahouse-aws-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=infrahouse-aws-control:AWS_SECRET_ACCESS_KEY]
module.repos["infrahouse-aws-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=infrahouse-aws-control:AWS_ACCESS_KEY_ID]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=infrahouse-website-infra:AWS_ACCESS_KEY_ID]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "proxysql-sandbox"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.repos["proxysql-sandbox"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Terraform live module to deploy ProxySQL sandbox on AWS"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "proxysql-sandbox"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
    }

  # module.repos["proxysql-sandbox"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "proxysql-sandbox"
      + team_id    = "7332815"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Adata.external.env: Reading...%0Adata.external.env: Read complete after 0s [id=-]%0Amodule.ih_8_repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Amodule.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Amodule.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Adata.aws_secretsmanager_secrets.gh_secrets: Reading...%0Adata.aws_ssm_parameter.gh_secrets_namespace: Reading...%0Adata.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]%0Amodule.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Adata.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]%0Amodule.ih_8_repos["aws-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-control:akuzminsky]%0Amodule.ih_8_repos["aws-control"].github_branch_default.main: Refreshing state... [id=aws-control]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]%0Amodule.ih_8_repos["aws-s3-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=aws-s3-control:akuzminsky]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_key: Reading...%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]%0Amodule.aws_creds["aws-control"].data.aws_secretsmanager_secret.aws_key: Reading...%0Amodule.aws_creds["aws-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]%0Amodule.aws_creds["aws-s3-control"].data.aws_secretsmanager_secret.aws_key: Reading...%0Amodule.aws_creds["aws-s3-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_s3-QMEaDX]%0Amodule.aws_creds["github-control"].data.aws_secretsmanager_secret.aws_key: Reading...%0Amodule.aws_creds["github-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_github-iYMNb3]%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_key: Reading...%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["infrahouse-aws-control"].github_repository.repo: Refreshing state... [id=infrahouse-aws-control]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_key: Reading...%0Amodule.aws_creds["infrahouse-website-infra"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 1s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...%0Amodule.aws_creds["infrahouse-aws-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]%0Amodule.aws_creds["aws-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...%0Amodule.aws_creds["aws-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_aws-uWJ1L2|AWSCURRENT]%0Amodule.aws_creds["aws-s3-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...%0Amodule.aws_creds["aws-s3-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_s3-QMEaDX|AWSCURRENT]%0Amodule.aws_creds["github-control"].data.aws_secretsmanager_secret_version.aws_key: Reading...%0Amodule.aws_creds["github-control"].data.aws_secretsmanager_secret_version.aws_key: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__tf_admin/tf_github-iYMNb3|AWSCURRENT]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=aws-s3-control:AWS_ACCESS_KEY_ID]%0Amodule.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=aws-control:AWS_ACCESS_KEY_ID]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=aws-s3-control:AWS_SECRET_ACCESS_KEY]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=github-control:AWS_DEFAULT_REGION]%0Amodule.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=aws-control:AWS_SECRET_ACCESS_KEY]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=aws-s3-control:AWS_ROLE]%0Amodule.ih_8_repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=github-control:AWS_SECRET_ACCESS_KEY]%0Amodule.ih_8_repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-s3-control:AWS_DEFAULT_REGION]%0Amodule.ih_8_repos["aws-s3-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-s3-control:GH_TOKEN]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=github-control:AWS_ACCESS_KEY_ID]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=github-control:AWS_ROLE]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["infrahouse-aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-aws-control]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.ih_8_repos["aws-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCxf584CEeam]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=infrahouse-website-infra:AWS_SECRET_ACCESS_KEY]%0Amodule.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-aws-control:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=infrahouse-website-infra:AWS_ROLE]%0Amodule.repos["infrahouse-aws-control"].github_actions_secret.secret["AWS_ROLE"]: Refreshing state... [id=infrahouse-aws-control:AWS_ROLE]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]%0Amodule.repos["infrahouse-aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-aws-control:GH_TOKEN]%0Amodule.repos["infrahouse-aws-control"].github_actions_secret.secret["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=infrahouse-aws-control:AWS_SECRET_ACCESS_KEY]%0Amodule.repos["infrahouse-aws-control"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=infrahouse-aws-control:AWS_ACCESS_KEY_ID]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=infrahouse-website-infra:AWS_ACCESS_KEY_ID]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "proxysql-sandbox"%0A      + secret_name     = "GH_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.repos["proxysql-sandbox"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "Terraform live module to deploy ProxySQL sandbox on AWS"%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_issues                  = true%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "proxysql-sandbox"%0A      + node_id                     = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + visibility                  = "public"%0A    }%0A%0A  # module.repos["proxysql-sandbox"].github_team_repository.dev will be created%0A  + resource "github_team_repository" "dev" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "push"%0A      + repository = "proxysql-sandbox"%0A      + team_id    = "7332815"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvNjFiZmM1N2YtOGYyNC00YzJhLThjNjgtZGIyZTA5OGM4MWVjL3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloOF90Zl90ZW1wbGF0ZS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tdGVtcGxhdGVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmV4dGVybmFsLmVudjogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5leHRlcm5hbC5lbnY6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPS1dXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfdGVhbS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1naF9zZWNyZXRzX25hbWVzcGFjZV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVBdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfdGZfdGVtcGxhdGUuZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXZbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLXRlbXBsYXRlXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW1fbWVtYmVycy5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRzLmdoX3NlY3JldHM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOmFrdXptaW5za3ldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVB8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpha3V6bWluc2t5XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJhd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiYXdzLXMzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJhd3MtczMtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX3MzLVFNRWFEWF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJnaXRodWItY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImdpdGh1Yi1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfZ2l0aHViLWlZTU5iM11cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJ8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyfEFXU0NVUlJFTlRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyfEFXU0NVUlJFTlRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiYXdzLXMzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImF3cy1zMy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9zMy1RTUVhRFh8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJnaXRodWItY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiZ2l0aHViLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2dpdGh1Yi1pWU1OYjN8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpHSF9UT0tFTl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19BQ0NFU1NfS0VZX0lEXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpBV1NfQUNDRVNTX0tFWV9JRF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19BQ0NFU1NfS0VZX0lEXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpBV1NfQUNDRVNTX0tFWV9JRF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2w6QVdTX1NFQ1JFVF9BQ0NFU1NfS0VZXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfU0VDUkVUX0FDQ0VTU19LRVlcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkFXU19TRUNSRVRfQUNDRVNTX0tFWV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ST0xFXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpBV1NfUk9MRV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6QVdTX0RFRkFVTFRfUkVHSU9OXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX1NFQ1JFVF9BQ0NFU1NfS0VZXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpBV1NfU0VDUkVUX0FDQ0VTU19LRVldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6R0hfVE9LRU5dXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOkFXU19ERUZBVUxUX1JFR0lPTl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpHSF9UT0tFTl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19BQ0NFU1NfS0VZX0lEXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpBV1NfQUNDRVNTX0tFWV9JRF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ST0xFXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpBV1NfUk9MRV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLWF3cy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uLm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUJQUl9rd0RPSTJ2dTdNNENBaWNpXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9KQ3hmNTg0Q0VlYW1dXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0pDZWlVYzRDRVp2UV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX1NFQ1JFVF9BQ0NFU1NfS0VZXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6QVdTX1NFQ1JFVF9BQ0NFU1NfS0VZXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sOkdIX1RPS0VOXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfREVGQVVMVF9SRUdJT05dXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2w6QVdTX0RFRkFVTFRfUkVHSU9OXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfUk9MRVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19ST0xFXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX1JPTEVcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2w6QVdTX1JPTEVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6R0hfVE9LRU5dXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbDpHSF9UT0tFTl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfU0VDUkVUX0FDQ0VTU19LRVldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfQUNDRVNTX0tFWV9JRFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfQUNDRVNTX0tFWV9JRF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiUFlQSV9BUElfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpQWVBJX0FQSV9UT0tFTl1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0FDQ0VTU19LRVlfSURcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfQUNDRVNTX0tFWV9JRF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpHSF9UT0tFTl1cdTAwMWJbMG1cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGVcdTAwMWJbMG1cblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUucmVwb3NbXCJwcm94eXNxbC1zYW5kYm94XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXVx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInNlY3JldFwiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGNyZWF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXBvc2l0b3J5ICAgICAgPSBcInByb3h5c3FsLXNhbmRib3hcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc2VjcmV0X25hbWUgICAgID0gXCJHSF9UT0tFTlwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYWxsb3dfYXV0b19tZXJnZSAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFsbG93X21lcmdlX2NvbW1pdCAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFsbG93X3NxdWFzaF9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFyY2hpdmVkICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBkZWZhdWx0X2JyYW5jaCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBkZWxldGVfYnJhbmNoX29uX21lcmdlICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gZGVzY3JpcHRpb24gICAgICAgICAgICAgICAgID0gXCJUZXJyYWZvcm0gbGl2ZSBtb2R1bGUgdG8gZGVwbG95IFByb3h5U1FMIHNhbmRib3ggb24gQVdTXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGV0YWcgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGZ1bGxfbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGhhc19pc3N1ZXMgICAgICAgICAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGh0bWxfdXJsICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG1lcmdlX2NvbW1pdF9tZXNzYWdlICAgICAgICA9IFwiUFJfVElUTEVcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwicHJveHlzcWwtc2FuZGJveFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBub2RlX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwcml2YXRlICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXBvX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2UgPSBcIkNPTU1JVF9NRVNTQUdFU1wiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzc2hfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzdm5fdXJsICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB2aXNpYmlsaXR5ICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBldGFnICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBlcm1pc3Npb24gPSBcInB1c2hcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSA9IFwicHJveHlzcWwtc2FuZGJveFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCJcbiAgICB9XG5cblx1MDAxYlsxbVBsYW46XHUwMDFiWzBtIDMgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXHUwMDFiWzBtXHUwMDFiWzkwbVxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUwMDFiWzBtXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloOF90Zl90ZW1wbGF0ZS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tdGVtcGxhdGVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5leHRlcm5hbC5lbnY6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmV4dGVybmFsLmVudjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9LV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfdGVhbS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfb3JnYW5pemF0aW9uX3NldHRpbmdzLmluZnJhaG91c2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTEyMTk4NDI2M11cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldHMuZ2hfc2VjcmV0czogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1naF9zZWNyZXRzX25hbWVzcGFjZV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnB5cGlfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tZGhJSTlQXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF90Zl90ZW1wbGF0ZS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tdGVtcGxhdGVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW1fbWVtYmVycy5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2w6YWt1em1pbnNreV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UHxBV1NDVVJSRU5UXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpha3V6bWluc2t5XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfYXdzLXVXSjFMMl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJhd3MtczMtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJhd3MtczMtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX3MzLVFNRWFEWF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiZ2l0aHViLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiZ2l0aHViLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9naXRodWItaVlNTmIzXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5hd3Nfa2V5OiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyfEFXU0NVUlJFTlRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX190Zl9hZG1pbi90Zl9hd3MtdVdKMUwyfEFXU0NVUlJFTlRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImF3cy1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiYXdzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2F3cy11V0oxTDJ8QVdTQ1VSUkVOVF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiYXdzLXMzLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5hd3NfY3JlZHNbXCJhd3MtczMtY29udHJvbFwiXS5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5hd3Nfa2V5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fdGZfYWRtaW4vdGZfczMtUU1FYURYfEFXU0NVUlJFTlRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmF3c19jcmVkc1tcImdpdGh1Yi1jb250cm9sXCJdLmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmF3c19rZXk6IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYXdzX2NyZWRzW1wiZ2l0aHViLWNvbnRyb2xcIl0uZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uYXdzX2tleTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX3RmX2FkbWluL3RmX2dpdGh1Yi1pWU1OYjN8QVdTQ1VSUkVOVF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0FDQ0VTU19LRVlfSURcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOkFXU19BQ0NFU1NfS0VZX0lEXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19BQ0NFU1NfS0VZX0lEXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpBV1NfQUNDRVNTX0tFWV9JRF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfU0VDUkVUX0FDQ0VTU19LRVlcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sOkFXU19TRUNSRVRfQUNDRVNTX0tFWV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkFXU19ERUZBVUxUX1JFR0lPTl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfU0VDUkVUX0FDQ0VTU19LRVlcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkFXU19TRUNSRVRfQUNDRVNTX0tFWV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfUk9MRVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2w6QVdTX1JPTEVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX1NFQ1JFVF9BQ0NFU1NfS0VZXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpBV1NfU0VDUkVUX0FDQ0VTU19LRVldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkdIX1RPS0VOXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2w6QVdTX0RFRkFVTFRfUkVHSU9OXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbDpHSF9UT0tFTl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfQUNDRVNTX0tFWV9JRFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6QVdTX0FDQ0VTU19LRVlfSURdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX1JPTEVcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkFXU19ST0xFXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtYXdzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0kydnU3TTRDQWljaV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0pDeGY1ODRDRWVhbV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0pDZWlVYzRDRVp2UV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19TRUNSRVRfQUNDRVNTX0tFWV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfREVGQVVMVF9SRUdJT05dXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sOkFXU19ERUZBVUxUX1JFR0lPTl1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ST0xFXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6QVdTX1JPTEVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX1JPTEVcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2w6QVdTX1JPTEVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkdIX1RPS0VOXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sOkdIX1RPS0VOXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19TRUNSRVRfQUNDRVNTX0tFWVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbDpBV1NfU0VDUkVUX0FDQ0VTU19LRVldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0FDQ0VTU19LRVlfSURcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2w6QVdTX0FDQ0VTU19LRVlfSURdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJQWVBJX0FQSV9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0FDQ0VTU19LRVlfSURcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfQUNDRVNTX0tFWV9JRF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6R0hfVE9LRU5dXHUwMDFiWzBtJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgIFx1MDAxYlszMm0rXHUwMDFiWzBtIGNyZWF0ZVx1MDAxYlswbSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUucmVwb3NbXCJwcm94eXNxbC1zYW5kYm94XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXVx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlcG9zaXRvcnkgICAgICA9IFwicHJveHlzcWwtc2FuZGJveFwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc2VjcmV0X25hbWUgICAgID0gXCJHSF9UT0tFTlwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdXBkYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwb1x1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYWxsb3dfYXV0b19tZXJnZSAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBhbGxvd19tZXJnZV9jb21taXQgICAgICAgICAgPSB0cnVlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYWxsb3dfcmViYXNlX21lcmdlICAgICAgICAgID0gdHJ1ZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFsbG93X3NxdWFzaF9tZXJnZSAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBkZWxldGVfYnJhbmNoX29uX21lcmdlICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiVGVycmFmb3JtIGxpdmUgbW9kdWxlIHRvIGRlcGxveSBQcm94eVNRTCBzYW5kYm94IG9uIEFXU1wiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gZXRhZyAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGZ1bGxfbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaGFzX2lzc3VlcyAgICAgICAgICAgICAgICAgID0gdHJ1ZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGh0bWxfdXJsICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG1lcmdlX2NvbW1pdF9tZXNzYWdlICAgICAgICA9IFwiUFJfVElUTEVcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJwcm94eXNxbC1zYW5kYm94XCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBub2RlX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcHJpdmF0ZSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2UgPSBcIkNPTU1JVF9NRVNTQUdFU1wiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNzaF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzdm5fdXJsICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdmlzaWJpbGl0eSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIiUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXZcdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl90ZWFtX3JlcG9zaXRvcnlcIiBcImRldlwiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBldGFnICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcGVybWlzc2lvbiA9IFwicHVzaFwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVwb3NpdG9yeSA9IFwicHJveHlzcWwtc2FuZGJveFwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiJTBBICAgIH0lMEElMEFcdTAwMWJbMW1QbGFuOlx1MDAxYlswbSAzIHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEFcdTAwMWJbMG1cdTAwMWJbOTBtJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUwMDFiWzBtJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDMsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>